DataProcessors/РаспределениеИМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>РаспределениеИМ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МагазинДляОтправкиОстатковРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереодическоеЗадание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодическиеЗадания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/РаспределениеИМ/Forms/ФормаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	ОбновитьСтатусыНаСервере() 
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	//ОбработкаОбъект.ПроанализироватьТекущееСостояниеИПредпринятьДействия(ТекущаяДата());
	ТекСтатусы = ОбработкаОбъект.ПолучитьСтатусы(ТекущаяДата());
	Если ТекСтатусы <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекСтатусы);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПереодическоеЗадание = Справочники.ПериодическиеЗадания.НайтиПоНаименованию("Распределение для ИМ");
	Если ЗначениеЗаполнено(ПереодическоеЗадание) Тогда
		Авто = НЕ ПереодическоеЗадание.НеВыполнять;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоПланированию(Команда)
	ОткрытьФорму("Отчет.АнализПланированияПоИМ.Форма",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСтатусыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИсполнениеЗаказовИМ(Команда)
	ОткрытьФорму("Отчет.ИсполнениеЗаказовИМ.Форма",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	ОткрытьФорму("Обработка.РаспределениеИМ.Форма.ФормаНастроек",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	ОткрытьФорму("Отчет.ОтчетИМ.Форма",,ЭтаФорма);
КонецПроцедуры
